code-review/NRB_3471_3546/База_Было/DataProcessors/СверкаПоСтатикеЦБв1СиBQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СверкаПоСтатикеЦБв1СиBQ</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СписокЦБДляСверки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКодаДляСверки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКодовДляСверкиСтатикиЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДляСверки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AssetID</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ошибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьРасхождения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/НоминалЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НоминалЦБ</Name>
			<Comment>Номинал ЦБ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма номинала</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>32</v8:Digits>
							<v8:FractionDigits>20</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Comment>ЦБ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮридическиеЛицаМеждународныеКомпании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ФормаУдостоверенияПравообладания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФормаУдостоверенияПравообладания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Именные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПредъявителя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЦБ</Name>
			<Comment>Типы ценных бумаг</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Акция</Name>
					<Comment>Акция</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Облигация</Name>
					<Comment>Облигация</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вексель</Name>
					<Comment>Вексель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГДР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пай</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Золото</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДепозитарнаяРасписка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиринговыйСертификатУчастия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Варрант</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/СверкаПоСтатикеЦБв1СиBQ/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура заполняет ТЧ СверкаСтатикиЦБ, помещая в нее все ЦБ, которые приняты на обслуживание 
// и не сняты с него, или по которым есть остатки на текущую дату.
Процедура ЗаполнитьСписокЦБ() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦенныеБумаги.Ссылка КАК ЦеннаяБумага
	|ПОМЕСТИТЬ ВТ_ЦенныеБумаги
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|ГДЕ
	|	ЦенныеБумаги.ДатаПриемаНаОбслуживание <= &ТекущаяДата
	|	И ЦенныеБумаги.ДатаПриемаНаОбслуживание <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВЫБОР
	|			КОГДА ЦенныеБумаги.ДатаСнятияСОбслуживания = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			КОГДА ЦенныеБумаги.ДатаСнятияСОбслуживания > &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ ЦенныеБумаги.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиЦБОстатки.ЦБ
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ.Остатки(&ТекущаяДата, 1 = 1) КАК ОстаткиЦБОстатки
	|ГДЕ
	|	ОстаткиЦБОстатки.КоличествоОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЦенныеБумаги.ЦеннаяБумага КАК ЦеннаяБумага,
	|	ЦенныеБумаги.Наименование КАК Наименование
	|ИЗ
	|	ВТ_ЦенныеБумаги КАК ВТ_ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ПО (ЦенныеБумаги.Ссылка = ВТ_ЦенныеБумаги.ЦеннаяБумага)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЦенныеБумаги.ЦеннаяБумага,
	|	ЦенныеБумаги.Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЦенныеБумаги.Наименование";
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()) );
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = СписокЦБДляСверки.Добавить();
		НовСтрока.ЦеннаяБумага = Выборка.ЦеннаяБумага;
		ДанныеОКоде = РаботаСДаннымиBQВызовСервера.ТипКодаИКодДляСверки(НовСтрока.ЦеннаяБумага);
		НовСтрока.ТипКодаДляСверки = ДанныеОКоде.ТипКода;
		НовСтрока.КодДляСверки = СокрЛП(ДанныеОКоде.Код);
	КонецЦикла;
КонецПроцедуры

// Выполняет сверку данных 1С ДЕПО с backQORT и возвращает описание найденых расхождений
// Параметры:
//	ИмяРеквизита - строка
// Возвращаемое значение:
//	- ТабличныйДокумент - также может быть строка с ошибкой.
Функция РезультатСверкиДанных(ИмяРеквизита = Неопределено) Экспорт
	Перем АДО;
	
	Если Не ПодключениеАДОУстановлено(АДО) Тогда
		Возврат "Не удалось подключиться к базе BQ";
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Если ЗначениеЗаполнено(ИмяРеквизита) Тогда
		ДлинаИмениРеквизита = СтрДлина(ИмяРеквизита);
		ПрефиксЦБ = "ЦБ: ";
		ПрефиксЭмитент = "Эмитент: ";
		Если Лев(ИмяРеквизита, СтрДлина(ПрефиксЦБ)) = ПрефиксЦБ Тогда
			ТипСущности = "ЦБ";
			ИмяРеквизитаДЕПО = Прав(ИмяРеквизита, ДлинаИмениРеквизита - СтрДлина(ПрефиксЦБ) );
			СоответствиеИменРеквизитов = СоответствиеИменОсновныхРеквизитовЦБ();
		Иначе
			ТипСущности = "Эмитент";
			ИмяРеквизитаДЕПО = Прав(ИмяРеквизита, ДлинаИмениРеквизита - СтрДлина(ПрефиксЭмитент) );
			СоответствиеИменРеквизитов = СоответствиеИменОсновныхРеквизитовЭмитента();
		КонецЕсли;
		СверяемыйРеквизит = Новый Структура();
		СверяемыйРеквизит.Вставить("ИмяРеквизитаДЕПО", ИмяРеквизитаДЕПО);
		СверяемыйРеквизит.Вставить("ИмяРеквизитаBQ", СоответствиеИменРеквизитов[ИмяРеквизитаДЕПО]);
		СверяемыйРеквизит.Вставить("ЧислоРасхождений", 0);
		СверяемыйРеквизит.Вставить("ТипСущности", ТипСущности);
		Макет = Обработки.СверкаПоСтатикеЦБв1СиBQ.ПолучитьМакет("МакетОтчетаОРасхожденияхПоОдномуРеквизиту");
		ОбластьШапкаОтчета = Макет.ПолучитьОбласть("ОбластьШапкаОтчета");
		ОбластьШапкаОтчета.Параметры.ИмяРеквизита = ИмяРеквизита;
		ЗаголовокСущности = ?(ТипСущности = "ЦБ", "Наименование ЦБ", "Наименование ЦБ / Эмитента");
		ОбластьШапкаОтчета.Параметры.ЗаголовокСущности = ЗаголовокСущности;
		ТабДок.Вывести(ОбластьШапкаОтчета);
	Иначе
		Макет = Обработки.СверкаПоСтатикеЦБв1СиBQ.ПолучитьМакет("МакетОтчетаОРасхождениях");
		СверяемыйРеквизит = Неопределено;
	КонецЕсли;
	Для Каждого СтрокаТЧ Из СписокЦБДляСверки Цикл
		ПолучитьИСверитьДанныеПоОднойЦБ(АДО, СтрокаТЧ, СверяемыйРеквизит, ТабДок, Макет);
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	Если СписокЦБДляСверки.Количество() > 1 Тогда
		ТабДок.ПоказатьУровеньГруппировокСтрок(0);
	Иначе
		ТабДок.ПоказатьУровеньГруппировокСтрок(1);
	КонецЕсли;
	
	Возврат ТабДок;
КонецФункции 

// Проверяет найдены ли расхождения при сверке
// Возвращаемое значение:
//	- Булево
Функция НайденыРасхождения() Экспорт
	НайденыРасхождения = Ложь;
	Для Каждого СтрокаТЧ Из СписокЦБДляСверки Цикл
		Если СтрокаТЧ.ЕстьРасхождения Тогда
			НайденыРасхождения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НайденыРасхождения;
КонецФункции

// Возвращает соответствие имен основных реквизитов ЦБ в 1C ДЕПО И backQORT
// Возвращаемое значение:
//	- Соответствие
Функция СоответствиеИменОсновныхРеквизитовЦБ() Экспорт
	СоответствиеИменРеквизитов = Новый Соответствие;
	
	СоответствиеИменРеквизитов.Вставить("КодRuData", "AssetRuDataCode");
	СоответствиеИменРеквизитов.Вставить("КодНРД", "AssetNrdCode");
	СоответствиеИменРеквизитов.Вставить("ISIN", "ISIN");
	СоответствиеИменРеквизитов.Вставить("НомерРегистрации", "RegistrationCode");
	СоответствиеИменРеквизитов.Вставить("Наименование", "ViewName");
	СоответствиеИменРеквизитов.Вставить("ПолноеНаименование", "Name");
	СоответствиеИменРеквизитов.Вставить("CFI", "CFI");
	СоответствиеИменРеквизитов.Вставить("КодВалютыНоминала", "BaseCurrencyCode");
	СоответствиеИменРеквизитов.Вставить("ТекущийНоминал", "BaseValue");
	СоответствиеИменРеквизитов.Вставить("НачальныйНоминал", "BaseValueOrigin");
	СоответствиеИменРеквизитов.Вставить("НаименованиеВыпуска", "DocName");
	СоответствиеИменРеквизитов.Вставить("ДатаГосРег", "RegistrationDate");
	СоответствиеИменРеквизитов.Вставить("ФормаВыпуска", "IsDoc");
	СоответствиеИменРеквизитов.Вставить("ДатаРазмещения", "EmitDate");
	СоответствиеИменРеквизитов.Вставить("ОбъемРазмещения", "EmitSize"); 
	СоответствиеИменРеквизитов.Вставить("УдостоверениеПравообладания", "IsBearer");
	СоответствиеИменРеквизитов.Вставить("БазовыйАктивКодRuData", "BaseAssetRuDataCode");
	СоответствиеИменРеквизитов.Вставить("ЗнаменательДелитьНаЧислитель", "BaseAssetSize");
	СоответствиеИменРеквизитов.Вставить("ДляКвалифицированныхИнвесторов", "IsForQualInv");
	СоответствиеИменРеквизитов.Вставить("Дефолтная", "IsDefault");
	СоответствиеИменРеквизитов.Вставить("КодСтраны", "Country");
	СоответствиеИменРеквизитов.Вставить("ДатаПогашения", "CancelDate");
	СоответствиеИменРеквизитов.Вставить("ДатаВключенияВПереченьБумагВИСЭ", "OpenMIIDate");
	СоответствиеИменРеквизитов.Вставить("ДатаИсключенияИзПеречняБумагВИСЭ", "CloseMIIDate");
	СоответствиеИменРеквизитов.Вставить("ЦБДопущенаКТоргамВРФ", "IsAdmittedTrading");
	СоответствиеИменРеквизитов.Вставить("КупоновВГод", "CouponsPerYear");
	СоответствиеИменРеквизитов.Вставить("РазрядностьНКД", "CouponScale");
	СоответствиеИменРеквизитов.Вставить("БазисРасчетаНКД", "NkdCalcBasis");
	СоответствиеИменРеквизитов.Вставить("НФИ", "Nfi");
	
	Возврат СоответствиеИменРеквизитов;
КонецФункции

// Возвращает соответствие имен основных реквизитов эмитента в 1C ДЕПО И backQORT
// Возвращаемое значение:
//	- Соответствие
Функция СоответствиеИменОсновныхРеквизитовЭмитента() Экспорт
	СоответствиеИменРеквизитов = Новый Соответствие;
	СоответствиеИменРеквизитов.Вставить("КодRuData", "EmitentRuDataCode");
	СоответствиеИменРеквизитов.Вставить("КодНРД", "EmitentNrdCode");
	СоответствиеИменРеквизитов.Вставить("КодLEI", "LEI");
	СоответствиеИменРеквизитов.Вставить("ИНН", "INN");
	СоответствиеИменРеквизитов.Вставить("TIN", "TIN");
	СоответствиеИменРеквизитов.Вставить("ПолноеНаименование", "Name");
	СоответствиеИменРеквизитов.Вставить("Наименование", "FirmShortName");
	СоответствиеИменРеквизитов.Вставить("ПолноеНаименованиеНаАнглийскомЯзыке", "EngName");
	СоответствиеИменРеквизитов.Вставить("КПП", "KPP");
	СоответствиеИменРеквизитов.Вставить("КодПоОКПО", "OKPO");
	СоответствиеИменРеквизитов.Вставить("ОГРН", "RegistrNum");
	СоответствиеИменРеквизитов.Вставить("ДатаГосРегистрации", "RegistrDate");
	СоответствиеИменРеквизитов.Вставить("РегистрирующийОрган", "RegistrOfficial");
	СоответствиеИменРеквизитов.Вставить("ОКОГУ", "OKOGU");
	СоответствиеИменРеквизитов.Вставить("ОКФС", "OKFS");
	СоответствиеИменРеквизитов.Вставить("ОКОПФ", "OKOPF");
	СоответствиеИменРеквизитов.Вставить("РегНомер", "RegistrFormNum");
	СоответствиеИменРеквизитов.Вставить("ДатаВнесенияВЕГРЮЛ", "RegistrDate2002");
	СоответствиеИменРеквизитов.Вставить("НеРезидент", "IsTaxResident");
	СоответствиеИменРеквизитов.Вставить("КодСтраны", "Country");
	СоответствиеИменРеквизитов.Вставить("МеждународнаяОрганизация", "IsInternationalOrganization");
	СоответствиеИменРеквизитов.Вставить("МеждународнаяКомпания", "IsInternationalCompany");
	СоответствиеИменРеквизитов.Вставить("ДатаСменыСтатусаМК", "CategoryChangeDate");
	СоответствиеИменРеквизитов.Вставить("КредитнаяОрганизация", "IsCreditOrganisation");
	СоответствиеИменРеквизитов.Вставить("КодСектораЭкономикиИностранногоЭмитента", "CodeSector");
	СоответствиеИменРеквизитов.Вставить("Адрес",  "AdditionalAddr");
	СоответствиеИменРеквизитов.Вставить("Телефоны", "Phones");
	СоответствиеИменРеквизитов.Вставить("Email", "Email");
	СоответствиеИменРеквизитов.Вставить("ВебСтраница", "URL");
	
	Возврат СоответствиеИменРеквизитов;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПодключениеАДОУстановлено(АДО)
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.НРБСервисStoredProcSQL;
	Попытка
		ПараметрыСоединения = Неопределено;
		ВнешниеДанные.ДобавитьПараметрСоединения(ПараметрыСоединения, "ВнешнийИсточник", ВнешнийИсточник);
		ВнешниеДанные.ИнициироватьСоединение(АДО, "АДО", ПараметрыСоединения);
		СоединениеУстановлено = Истина;
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщенияОбОшибке = "При установить соединение с SQL базой backQORT для получить данных произошла ошибка: " + ТекстОшибки;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
		ЗаписьЖурналаРегистрации("Сверка статики ЦБ с BQ", УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщенияОбОшибке);
		СоединениеУстановлено = Ложь;
	КонецПопытки;
	
	Возврат СоединениеУстановлено;
КонецФункции

Процедура ПолучитьИСверитьДанныеПоОднойЦБ(АДО, СтрокаТЧ, СверяемыйРеквизит, ТабДок, Макет)
	ЕстьРасхождения = Ложь;
	
	ОбязательностьДанных = Истина;
	ТЗОсновныеДанныеЦБ_BQ = ДанныеИзBQ(АДО, СтрокаТЧ, "GetAssetByCode", "ЦБ", ОбязательностьДанных);
	ТЗОсновныеДанныеЦБ_ДЕПО = ОсновныеДанныеЦБ_ДЕПО(СтрокаТЧ.ЦеннаяБумага);
	ОсновныеДанныеЦБ_ДЕПО = ТЗОсновныеДанныеЦБ_ДЕПО[0];
	Если ЗначениеЗаполнено(ТЗОсновныеДанныеЦБ_BQ) Тогда
		ОсновныеДанныеЦБ_BQ = ТЗОсновныеДанныеЦБ_BQ[0];
		СтрокаТЧ.AssetID = ОсновныеДанныеЦБ_BQ.id;
	Иначе
		ОсновныеДанныеЦБ_BQ = Неопределено;
	КонецЕсли;
	
	Если СверяемыйРеквизит = Неопределено Тогда
		ЕстьРасхождения = ЕстьРасхожденияПриСверкеВсехРеквизитовЦБ(АДО, СтрокаТЧ, ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО, ТабДок, Макет);
	Иначе
		ЕстьРасхождения = ЕстьРасхожденияПриСверкеОдногоРеквизитаЦБ(АДО, СтрокаТЧ, ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО,
																	СверяемыйРеквизит, ТабДок, Макет);
	КонецЕсли;
	
	СтрокаТЧ.ЕстьРасхождения = ЕстьРасхождения;
КонецПроцедуры

Функция ЕстьРасхожденияПриСверкеОдногоРеквизитаЦБ(АДО, СтрокаТЧ, ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО,
												СверяемыйРеквизит, ТабДок, Макет)
	НесовпадающиеПоля = НовыйТаблицаПолейСНесовпадающимиЗначениями();
	Если СверяемыйРеквизит.ИмяРеквизитаДЕПО = "Эмитент" Или СверяемыйРеквизит.ТипСущности = "Эмитент" Тогда
		МожноВозвращатьНеопределено = Истина;
		ДанныеИзBQ = ДанныеЭмитентаBQ(АДО, СтрокаТЧ, МожноВозвращатьНеопределено);
		ДанныеИзДЕПО = ДанныеЭмитентаДЕПО(СтрокаТЧ.ЦеннаяБумага);
	Иначе
		ДанныеИзBQ = ОсновныеДанныеЦБ_BQ;
		ДанныеИзДЕПО = ОсновныеДанныеЦБ_ДЕПО;
	КонецЕсли;
	
	ИмяРеквизитаBQ = СверяемыйРеквизит.ИмяРеквизитаBQ;
	ИмяРеквизитаДЕПО = СверяемыйРеквизит.ИмяРеквизитаДЕПО;
	Если СверяемыйРеквизит.ТипСущности = "ЦБ" Тогда
		СравнитьОдинРеквизитЦБ(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
	Иначе
		СравнитьОдинРеквизитЭмитента(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
	КонецЕсли;
	ЕстьРасхождения = НесовпадающиеПоля.Количество() > 0;
	
	Если ЕстьРасхождения Тогда
		ИнформацияОРасхождении = НесовпадающиеПоля[0];
		ОбластьСтрокаОтчета = Макет.ПолучитьОбласть("ОбластьСтрокаОтчета");
		СверяемыйРеквизит.ЧислоРасхождений = СверяемыйРеквизит.ЧислоРасхождений + 1;
		ОбластьСтрокаОтчета.Параметры.НПП = СверяемыйРеквизит.ЧислоРасхождений;
		Если Не ПустаяСтрока(ОсновныеДанныеЦБ_ДЕПО.ISIN) Тогда
			ОбластьСтрокаОтчета.Параметры.ISIN_ИлиРегНомер = ОсновныеДанныеЦБ_ДЕПО.ISIN;
		Иначе
			ОбластьСтрокаОтчета.Параметры.ISIN_ИлиРегНомер = ОсновныеДанныеЦБ_ДЕПО.НомерРегистрации;
		КонецЕсли;
		НаименованиеЦБ = ОсновныеДанныеЦБ_ДЕПО.Наименование;
		Если СверяемыйРеквизит.ТипСущности = "Эмитент" Тогда
			НаименованиеЦБ = НаименованиеЦБ + " / " + ДанныеИзДЕПО.Наименование;
			ОбластьСтрокаОтчета.Параметры.Эмитент = ДанныеИзДЕПО.Ссылка;
		КонецЕсли;
		ОбластьСтрокаОтчета.Параметры.НаименованиеЦБ = НаименованиеЦБ;
		ОбластьСтрокаОтчета.Параметры.ЦБ = ОсновныеДанныеЦБ_ДЕПО.Ссылка;
		ОбластьСтрокаОтчета.Параметры.ТипКодаДляСверки = СтрокаТЧ.ТипКодаДляСверки;
		ОбластьСтрокаОтчета.Параметры.КодДляСверки = СтрокаТЧ.КодДляСверки;
		ОбластьСтрокаОтчета.Параметры.Значение1С = ИнформацияОРасхождении.ЗначениеПоляДЕПО;
		ОбластьСтрокаОтчета.Параметры.ЗначениеBQ = ИнформацияОРасхождении.ЗначениеПоляBQ;
		ТабДок.Вывести(ОбластьСтрокаОтчета);
	КонецЕсли;
	
	Возврат ЕстьРасхождения;
КонецФункции

Функция ЕстьРасхожденияПриСверкеВсехРеквизитовЦБ(АДО, СтрокаТЧ, ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО, ТабДок, Макет)
	ЕстьРасхождения = Ложь;
	ЗаголовокПоЦБВыведен = Ложь;
	
	Если ОсновныеДанныеЦБ_BQ <> Неопределено Тогда
		СверитьОсновныеПоляЦБ(ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО, ЗаголовокПоЦБВыведен,
			ТабДок, Макет, ЕстьРасхождения);
		ТЗНоминалЦБ_BQ = ДанныеИзBQ(АДО, СтрокаТЧ, "GetAssetBaseValues", "номинале ЦБ");
		СверитьДанныеПоНоминалу(СтрокаТЧ.ЦеннаяБумага, ТЗНоминалЦБ_BQ, ЗаголовокПоЦБВыведен, ОсновныеДанныеЦБ_ДЕПО,
			ТабДок, Макет, ЕстьРасхождения);
		ТЗКупоныЦБ_BQ = ДанныеИзBQ(АДО, СтрокаТЧ, "GetAssetCoupons", "купонах ЦБ");
		СверитьДанныеПоКупонам(СтрокаТЧ.ЦеннаяБумага, ТЗКупоныЦБ_BQ, ЗаголовокПоЦБВыведен, ОсновныеДанныеЦБ_ДЕПО,
			ТабДок, Макет, ЕстьРасхождения);
		ТЗ_НКД_ЦБ_BQ = ДанныеИзBQ(АДО, СтрокаТЧ, "GetAssetAccruedInt", "НКД по ЦБ");
		СверитьДанныеПоНКД(СтрокаТЧ.ЦеннаяБумага, ТЗ_НКД_ЦБ_BQ, ЗаголовокПоЦБВыведен, ОсновныеДанныеЦБ_ДЕПО,
			ТабДок, Макет, ЕстьРасхождения);
		ДанныеЭмитентаBQ = ДанныеЭмитентаBQ(АДО, СтрокаТЧ);
		СверитьДанныеПоЭмитенту(СтрокаТЧ.ЦеннаяБумага, ДанныеЭмитентаBQ, ЗаголовокПоЦБВыведен, ОсновныеДанныеЦБ_ДЕПО,
			ТабДок, Макет, ЕстьРасхождения);
	Иначе
		ВывестиИнформациюОбОтсутствииИнформацииВ_BQ(ОсновныеДанныеЦБ_ДЕПО, СтрокаТЧ.ТипКодаДляСверки, ЗаголовокПоЦБВыведен, ТабДок, Макет);
		ЕстьРасхождения = Истина;
	КонецЕсли;
	
	Возврат ЕстьРасхождения;
КонецФункции

Функция ДанныеИзBQ(АДО, СтрокаТЧ, ИмяХП, ОписаниеДанныхВПредложномПадеже, ОбязательностьДанных = Ложь)
	ДанныеИзBQ = Неопределено;
	
	ТекстСообщенияОбОшибке = "";
	ВходныеПараметры = Новый Структура;
	Если ИмяХП = "GetAssetByCode" Тогда
		ВходныеПараметры.Вставить("CodeType", РаботаСДаннымиBQВызовСервера.ИмяДляПолученияЗначения(СтрокаТЧ.ТипКодаДляСверки) );
		ВходныеПараметры.Вставить("Code", СтрокаТЧ.КодДляСверки);
	ИначеЕсли ИмяХП = "GetAssetAccruedInt" Тогда
		ВходныеПараметры.Вставить("Asset_ID", СтрокаТЧ.AssetID);
		ВходныеПараметры.Вставить("Date", РаботаСДаннымиBQВызовСервера.Дата1СВДатуBQ(ТекущаяДатаСеанса()));
	Иначе
		ВходныеПараметры.Вставить("Asset_ID", СтрокаТЧ.AssetID);
	КонецЕсли;
		
	Попытка
		ДанныеИзBQ = АДО.ВыполнитьХранимуюПроцедуру("[GATE].[" + ИмяХП + "]", ВходныеПараметры);
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ШаблонСообщенияОбОшибке = "При попытке получить из базы backQORT данные о "
									+ ОписаниеДанныхВПредложномПадеже + ": ""%1"" произошла ошибка: " + ТекстОшибки;
		ТекстСообщенияОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, Строка(СтрокаТЧ.ЦеннаяБумага));
	КонецПопытки;
	
	Если ТекстСообщенияОбОшибке = "" И ДанныеИзBQ = Неопределено Тогда
		ШаблонСообщенияОбОшибке = "Ошибочный результат при получении данных о " + ОписаниеДанныхВПредложномПадеже + ": ""%1"" в BQ";
		ТекстСообщенияОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, Строка(СтрокаТЧ.ЦеннаяБумага));
	КонецЕсли;
	Если ТекстСообщенияОбОшибке = "" И ОбязательностьДанных И ДанныеИзBQ.Количество() = 0 Тогда
		ШаблонСообщенияОбОшибке = "Нет данных о " + ОписаниеДанныхВПредложномПадеже + ": ""%1"" в BQ";
		ТекстСообщенияОбОшибке = СтрШаблон(ШаблонСообщенияОбОшибке, Строка(СтрокаТЧ.ЦеннаяБумага));
	КонецЕсли;
	
	ЕстьОшибки = ТекстСообщенияОбОшибке <> "";
	Если ЕстьОшибки Тогда
		СтрокаТЧ.ЕстьРасхождения = Истина;
		СтрокаТЧ.Ошибки = СтрокаТЧ.Ошибки + ?(Не ПустаяСтрока(СтрокаТЧ.Ошибки), Символы.ПС, "") + ТекстСообщенияОбОшибке;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОбОшибке);
	КонецЕсли;
	
	Возврат ДанныеИзBQ;
КонецФункции

Функция ОсновныеДанныеЦБ_ДЕПО(ЦеннаяБумага)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	// Наименование и коды
	|	ЦенныеБумаги.Ссылка КАК Ссылка,
	|	ЦенныеБумаги.Наименование КАК Наименование,
	|	ЦенныеБумаги.ПолноеНаименование КАК ПолноеНаименование,
	|	ЦенныеБумаги.ISIN КАК ISIN,
	|	ЦенныеБумаги.НомерРегистрации КАК НомерРегистрации,
	|	ЕСТЬNULL(КодыRuData.Код, """") КАК КодRuData,
	|	ЕСТЬNULL(КодыНРД.Код, """") КАК КодНРД,
	|	ЕСТЬNULL(БазовыеАктивыКодыRuData.Код, """") КАК БазовыйАктивКодRuData,
	|	// Классы ЦБ
	|	ЦенныеБумаги.ТипЦБ КАК ТипЦБ,
	|	ЦенныеБумаги.ВидЦБ КАК ВидЦБ,
	|	ЦенныеБумаги.ВидЦББанкаРоссии КАК ВидЦББанкаРоссии,
	|	ЕСТЬNULL(ЦенныеБумаги.ВидЦББанкаРоссии.Код, """") КАК ВидЦББанкаРоссииКод,
	|	ЦенныеБумаги.ПодвидОблигаций КАК ПодвидОблигаций,
	|	ЦенныеБумаги.НФИ КАК НФИ,
	|	// Прочее
	|	ЦенныеБумаги.CFI КАК CFI,
	|	ЕСТЬNULL(ЦенныеБумаги.ВалютаНоминала.Код, """") КАК КодВалютыНоминала,
	|	НоминалЦБСрезПоследних.Сумма КАК ТекущийНоминал,
	|	НоминалЦБСрезПервых.Сумма КАК НачальныйНоминал,
	|	ЦенныеБумаги.НаименованиеВыпуска КАК НаименованиеВыпуска,
	|	ЦенныеБумаги.ДатаГосРег КАК ДатаГосРег,
	|	ЦенныеБумаги.ФормаВыпуска КАК ФормаВыпуска,
	|	ЦенныеБумаги.ДатаРазмещения КАК ДатаРазмещения,
	|	ЦенныеБумаги.ОбъемРазмещения КАК ОбъемРазмещения,
	|	ЦенныеБумаги.УдостоверениеПравообладания КАК УдостоверениеПравообладания,
	|	// Это не ошибка - именно знаменатель нужно в данном случае поделить на числитель
	|	ВЫБОР
	|		КОГДА ЦенныеБумаги.Числитель = 0
	|			ТОГДА 0
	|		ИНАЧЕ ЦенныеБумаги.Знаменатель / ЦенныеБумаги.Числитель
	|	КОНЕЦ КАК ЗнаменательДелитьНаЧислитель,
	|	ЦенныеБумаги.ДляКвалифицированныхИнвесторов КАК ДляКвалифицированныхИнвесторов,
	|	ЦенныеБумаги.Дефолтная КАК Дефолтная,
	|	ЕСТЬNULL(ЦенныеБумаги.Страна.КодАльфа2, """") КАК КодСтраны,
	|	ЦенныеБумаги.ДатаПогашения КАК ДатаПогашения,
	|	ЦенныеБумаги.ДатаВключенияВПереченьБумагВИСЭ КАК ДатаВключенияВПереченьБумагВИСЭ,
	|	ЦенныеБумаги.ДатаИсключенияИзПеречняБумагВИСЭ КАК ДатаИсключенияИзПеречняБумагВИСЭ,
	|	ЦенныеБумаги.ЦБДопущенаКТоргамВРФ КАК ЦБДопущенаКТоргамВРФ,
	|	ЦенныеБумаги.КупоновВГод КАК КупоновВГод,
	|	ЦенныеБумаги.РазрядностьНКД КАК РазрядностьНКД,
	|	ЦенныеБумаги.БазисРасчетаНКД КАК БазисРасчетаНКД,
	|	ЦенныеБумаги.КупоннаяОблигация КАК КупоннаяОблигация
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыRuData
	|		ПО ЦенныеБумаги.Ссылка = КодыRuData.Владелец
	|			И (КодыRuData.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.RuData))
	|			И (НЕ КодыRuData.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыRuData.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыRuData.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыНРД
	|		ПО ЦенныеБумаги.Ссылка = КодыНРД.Владелец
	|			И (КодыНРД.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (НЕ КодыНРД.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыНРД.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыНРД.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК БазовыеАктивыКодыRuData
	|		ПО ЦенныеБумаги.БазовыйАктив = БазовыеАктивыКодыRuData.Владелец
	|			И (БазовыеАктивыКодыRuData.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.RuData))
	|			И (НЕ БазовыеАктивыКодыRuData.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА БазовыеАктивыКодыRuData.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА БазовыеАктивыКодыRuData.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПоследних(&ТекущаяДата, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалЦБСрезПоследних
	|		ПО (НоминалЦБСрезПоследних.ЦеннаяБумага = ЦенныеБумаги.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НоминалЦБ.СрезПервых(, ЦеннаяБумага = &ЦеннаяБумага) КАК НоминалЦБСрезПервых
	|		ПО (НоминалЦБСрезПоследних.ЦеннаяБумага = ЦенныеБумаги.Ссылка)
	|ГДЕ
	|	ЦенныеБумаги.Ссылка = &ЦеннаяБумага";
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ВывестиИнформациюОбОтсутствииИнформацииВ_BQ(ДанныеИзДЕПО, ТипКодаДляСверки, ЗаголовокПоЦБВыведен, ТабДок, Макет)
	ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ДанныеИзДЕПО, ТабДок, Макет);
	ОбластьНеНайдено = Макет.ПолучитьОбласть("ОбластьНеНайденоВ_BQ");
	ОбластьНеНайдено.Параметры.Текст = "Эту ЦБ не удалось найти в базе BQ опираясь на " + Строка(ТипКодаДляСверки);
	ТабДок.Вывести(ОбластьНеНайдено);
КонецПроцедуры

Процедура ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ДанныеИзДЕПО, ТабДок, Макет)
	Если Не ЗаголовокПоЦБВыведен Тогда
		ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовокЦБ");
		ОбластьЗаголовок.Параметры.КодRuData = ДанныеИзДЕПО.КодRuData;
		ОбластьЗаголовок.Параметры.КодНРД = ДанныеИзДЕПО.КодНРД;
		ОбластьЗаголовок.Параметры.ISIN = ДанныеИзДЕПО.ISIN;
		ОбластьЗаголовок.Параметры.НомерРегистрации = ДанныеИзДЕПО.НомерРегистрации;
		ОбластьЗаголовок.Параметры.Наименование = ДанныеИзДЕПО.Наименование;
		ОбластьЗаголовок.Параметры.Ссылка = ДанныеИзДЕПО.Ссылка;
		ГруппаОткрыта = Ложь;
		УровеньГруппировки = 1;
		ТабДок.Вывести(ОбластьЗаголовок, УровеньГруппировки, , ГруппаОткрыта);
		ЗаголовокПоЦБВыведен = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура СверитьОсновныеПоляЦБ(ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО, ЗаголовокПоЦБВыведен, ТабДок, Макет, ЕстьРасхождения)
	НесовпадающиеПоля = НовыйТаблицаПолейСНесовпадающимиЗначениями();
	
	СоответствиеИменРеквизитов = СоответствиеИменОсновныхРеквизитовЦБ();
	Для Каждого Элемент Из СоответствиеИменРеквизитов Цикл
		СравнитьОдинРеквизитЦБ(ОсновныеДанныеЦБ_BQ, ОсновныеДанныеЦБ_ДЕПО, Элемент.Значение, Элемент.Ключ, НесовпадающиеПоля);
	КонецЦикла;
	
	ЕстьРасхождения = (НесовпадающиеПоля.Количество() <> 0);
	Если ЕстьРасхождения Тогда
		ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ОсновныеДанныеЦБ_ДЕПО, ТабДок, Макет); 
		ТипРасхождений = "Расхождения в основной информации о ЦБ:";
		ВывестиИнформациюОНесовпадающихРеквизитах(ТипРасхождений, НесовпадающиеПоля, ТабДок, Макет, "ОсновныеПоляЦБ");
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьОдинРеквизитЦБ(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля)
	Если ДанныеИзBQ = Неопределено Тогда
		Если ИмяРеквизитаДЕПО = "Эмитент" Тогда
			ЗначениеРеквизитаДЕПО = ДанныеИзДЕПО["Наименование"] + " (Код RuData: " + СокрЛП(ДанныеИзДЕПО.КодRuData) + ")";
		Иначе
			ЗначениеРеквизитаДЕПО = ДанныеИзДЕПО[ИмяРеквизитаДЕПО];
		КонецЕсли;
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, "Н/Д", ЗначениеРеквизитаДЕПО);
	Иначе
		Если ИмяРеквизитаДЕПО = "ФормаВыпуска" Тогда
			СравнитьФормуВыпуска(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
		ИначеЕсли ИмяРеквизитаДЕПО = "УдостоверениеПравообладания" Тогда
			СравнитьУдостоверениеПравообладания(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
		ИначеЕсли ИмяРеквизитаДЕПО = "РазрядностьНКД" Тогда
			Если ДанныеИзДЕПО.КупоннаяОблигация Тогда
				СравнитьРеквизиты(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
			КонецЕсли;
		ИначеЕсли ИмяРеквизитаДЕПО = "БазисРасчетаНКД" Тогда
			Если ДанныеИзДЕПО.КупоннаяОблигация Тогда
				СравнитьБазисРасчетаНКД(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
			КонецЕсли;
		ИначеЕсли ИмяРеквизитаДЕПО = "Эмитент" Тогда
			СравнитьЭмитента(ДанныеИзBQ, ДанныеИзДЕПО, НесовпадающиеПоля);
		Иначе
			СравнитьРеквизиты(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьЭмитента(ДанныеИзBQ, ДанныеИзДЕПО, НесовпадающиеПоля)
	МожноСравнитьКоды = ЗначениеЗаполнено(ДанныеИзBQ.EmitentRuDataCode) И ЗначениеЗаполнено(ДанныеИзДЕПО.КодRuData);
	ЭмитентыНеСовпадают = (МожноСравнитьКоды И ДанныеИзBQ.EmitentRuDataCode <> СокрЛП(ДанныеИзДЕПО.КодRuData))
							Или (Не МожноСравнитьКоды И ДанныеИзBQ.FirmShortName <> СокрЛП(ДанныеИзДЕПО.Наименование));
	Если ЭмитентыНеСовпадают Тогда
		ЗначениеРеквизитаBQ = ДанныеИзBQ.FirmShortName + " (Код RuData: " + ДанныеИзBQ.EmitentRuDataCode + ")";
		ЗначениеРеквизитаДЕПО = ДанныеИзДЕПО.Наименование + " (Код RuData: " + СокрЛП(ДанныеИзДЕПО.КодRuData) + ")";
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, "Эмитент", "Эмитент", ЗначениеРеквизитаBQ, ЗначениеРеквизитаДЕПО);
	КонецЕсли;
КонецПроцедуры

Функция НовыйТаблицаПолейСНесовпадающимиЗначениями()
	НесовпадающиеПоля = Новый ТаблицаЗначений;
	НесовпадающиеПоля.Колонки.Добавить("ИмяПоляBQ");
	НесовпадающиеПоля.Колонки.Добавить("ЗначениеПоляBQ");
	НесовпадающиеПоля.Колонки.Добавить("ИмяПоляДЕПО");
	НесовпадающиеПоля.Колонки.Добавить("ЗначениеПоляДЕПО");
	
	Возврат НесовпадающиеПоля;
КонецФункции

Процедура СравнитьРеквизиты(ДанныеИзBQ, ДанныеИзДЕПО, ИмяПоляBQ, ИмяПоляДЕПО, НесовпадающиеПоля)
	ЗначениеПоляBQ = ДанныеИзBQ[ИмяПоляBQ];
	ЗначениеПоляДЕПО = ДанныеИзДЕПО[ИмяПоляДЕПО];
	ТипЗнчПоляBQ = ТипЗнч(ЗначениеПоляBQ);
	ТипЗнчПоляДЕПО = ТипЗнч(ЗначениеПоляДЕПО);
	ТипСтрока = Тип("Строка");
	ТипЧисло = Тип("Число");
	
	Если ТипЗнчПоляДЕПО = Тип("Булево") Тогда
		ЗначениеДляСравненияДЕПО = ЗначениеПоляДЕПО;
		Если ЗначениеПоляBQ = "y" Тогда
			ЗначениеДляСравненияBQ = Истина;
		ИначеЕсли ЗначениеПоляBQ = "n" Тогда
			ЗначениеДляСравненияBQ = Ложь;
		Иначе
			ЗначениеДляСравненияBQ = ЗначениеПоляBQ;
		КонецЕсли;
	ИначеЕсли ТипЗнчПоляДЕПО = Тип("Дата") И ТипЗнчПоляBQ = ТипЧисло Тогда
		ЗначениеДляСравненияДЕПО = ЗначениеПоляДЕПО;
		ЗначениеДляСравненияBQ = РаботаСДаннымиBQВызовСервера.ЧислоВДату(ЗначениеПоляBQ);
		ЗначениеПоляBQ = Формат(ЗначениеДляСравненияBQ, "ДФ=""дд.ММ.гггг""");
	ИначеЕсли ОбаПустыеЗначения(ЗначениеПоляДЕПО, ЗначениеПоляBQ) Тогда
		ЗначениеДляСравненияBQ = "";
		ЗначениеДляСравненияДЕПО = "";
	ИначеЕсли ТипЗнчПоляДЕПО = ТипСтрока И ТипЗнчПоляBQ = ТипЧисло Тогда
		ЗначениеДляСравненияBQ = ЧислоВСтроку(ЗначениеПоляBQ);
		ЗначениеДляСравненияДЕПО = СтрокаВЧисло(ЗначениеПоляДЕПО);
	ИначеЕсли ТипЗнчПоляДЕПО = ТипЧисло И ТипЗнчПоляBQ = ТипСтрока Тогда
		ЗначениеДляСравненияДЕПО = ЧислоВСтроку(ЗначениеПоляДЕПО);
		ЗначениеДляСравненияBQ = СтрокаВЧисло(ЗначениеПоляBQ);
	ИначеЕсли ТипЗнчПоляДЕПО = ТипСтрока Тогда
		ЗначениеДляСравненияДЕПО = СокрЛП(ЗначениеПоляДЕПО);
		ЗначениеДляСравненияBQ = СокрЛП(Строка(ЗначениеПоляBQ));
	Иначе
		ЗначениеДляСравненияДЕПО = ЗначениеПоляДЕПО;
		ЗначениеДляСравненияBQ = ЗначениеПоляBQ;
	КонецЕсли;
	
	Если ЗначениеДляСравненияBQ <> ЗначениеДляСравненияДЕПО Тогда
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяПоляBQ, ИмяПоляДЕПО, ЗначениеПоляBQ, ЗначениеПоляДЕПО);
	КонецЕсли;
КонецПроцедуры

Функция ОбаПустыеЗначения(ЗначениеПоляДЕПО, ЗначениеПоляBQ)
	ОбаПустые = (ЗначениеПоляДЕПО = "" Или ЗначениеПоляДЕПО = "0" Или ЗначениеПоляДЕПО = 0 Или ЗначениеПоляДЕПО = Null)
				И (ЗначениеПоляBQ = "" Или ЗначениеПоляBQ = "0" Или ЗначениеПоляBQ = 0 Или ЗначениеПоляBQ = Null);
	Возврат ОбаПустые;
КонецФункции

Процедура СравнитьФормуВыпуска(ДанныеИзBQ, ДанныеИзДЕПО, ИмяПоляBQ, ИмяПоляДЕПО, НесовпадающиеПоля)
	ЗначениеПоляBQ = ДанныеИзBQ[ИмяПоляBQ];
	ЗначениеПоляДЕПО = ДанныеИзДЕПО[ИмяПоляДЕПО];
	Совпадают = ЗначениеПоляBQ = "y" И ЗначениеПоляДЕПО = Перечисления.ФормаВыпускаЦБ.Документарная
				Или ЗначениеПоляBQ = "n" И ЗначениеПоляДЕПО = Перечисления.ФормаВыпускаЦБ.Бездокументарная
				Или ЗначениеПоляBQ = "" И ЗначениеПоляДЕПО = Перечисления.ФормаВыпускаЦБ.ПустаяСсылка();
	Если Не Совпадают Тогда
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяПоляBQ, ИмяПоляДЕПО, ЗначениеПоляBQ, ЗначениеПоляДЕПО);
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьУдостоверениеПравообладания(ДанныеИзBQ, ДанныеИзДЕПО, ИмяПоляBQ, ИмяПоляДЕПО, НесовпадающиеПоля)
	ЗначениеПоляBQ = ДанныеИзBQ[ИмяПоляBQ];
	ЗначениеПоляДЕПО = ДанныеИзДЕПО[ИмяПоляДЕПО];
	Совпадают = ЗначениеПоляBQ = "y" И ЗначениеПоляДЕПО = Перечисления.ФормаУдостоверенияПравообладания.НаПредъявителя
				Или ЗначениеПоляBQ = "n" И ЗначениеПоляДЕПО = Перечисления.ФормаУдостоверенияПравообладания.Именные;
	Если Не Совпадают Тогда
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяПоляBQ, ИмяПоляДЕПО, ЗначениеПоляBQ, ЗначениеПоляДЕПО);
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьБазисРасчетаНКД(ДанныеИзBQ, ДанныеИзДЕПО, ИмяПоляBQ, ИмяПоляДЕПО, НесовпадающиеПоля)
	ЗначениеПоляBQ = ДанныеИзBQ[ИмяПоляBQ];
	ЗначениеПоляДЕПО = СокрЛП(ДанныеИзДЕПО[ИмяПоляДЕПО]);
	// BSLLS:MagicNumber-off
	Если ДанныеИзДЕПО.ТипЦБ <> Перечисления.ТипыЦБ.Облигация Тогда
		Совпадают = (ЗначениеПоляBQ = 1 Или ЗначениеПоляBQ = 0 Или ЗначениеПоляBQ = Null);
	ИначеЕсли ЗначениеПоляДЕПО = "act/360" Тогда
		Совпадают = (ЗначениеПоляBQ = 1);
	ИначеЕсли ЗначениеПоляДЕПО = "act/365" Или ЗначениеПоляДЕПО = "NL/365" Тогда
		Совпадают = (ЗначениеПоляBQ = 3);
	ИначеЕсли ЗначениеПоляДЕПО = "30E/360" Тогда
		Совпадают = (ЗначениеПоляBQ = 4 Или ЗначениеПоляBQ = 13);
	ИначеЕсли ЗначениеПоляДЕПО = "act/366" Тогда
		Совпадают = (ЗначениеПоляBQ = 7);
	ИначеЕсли ЗначениеПоляДЕПО = "аct/act ISDA" Тогда
		Совпадают = (ЗначениеПоляBQ = 8);
	ИначеЕсли ЗначениеПоляДЕПО = "act/act" Тогда
		Совпадают = (ЗначениеПоляBQ = 9);
	ИначеЕсли ПустаяСтрока(ЗначениеПоляДЕПО) Тогда
		Совпадают = (ЗначениеПоляBQ = 0);
	Иначе //в том числе ЗначениеПоляДЕПО = "act/365L"
		Совпадают = (ЗначениеПоляBQ = 6);
	КонецЕсли;
	// BSLLS:MagicNumber-on
	
	Если Не Совпадают Тогда
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяПоляBQ, ИмяПоляДЕПО, ЗначениеПоляBQ, ЗначениеПоляДЕПО);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяПоляBQ, ИмяПоляДЕПО, ЗначениеПоляBQ, ЗначениеПоляДЕПО)
	НовСтрокаРасхождений = НесовпадающиеПоля.Добавить();
	НовСтрокаРасхождений.ИмяПоляBQ = ИмяПоляBQ;
	НовСтрокаРасхождений.ЗначениеПоляBQ = ЗначениеПоляBQ;
	НовСтрокаРасхождений.ИмяПоляДЕПО = ИмяПоляДЕПО;
	НовСтрокаРасхождений.ЗначениеПоляДЕПО = ЗначениеПоляДЕПО;
КонецПроцедуры

Процедура ВывестиИнформациюОНесовпадающихРеквизитах(ЗаголовокТаблицыРасхождений, НесовпадающиеПоля, ТабДок, Макет, ИмяГруппы)
	ГруппаОткрыта = Ложь;
	УровеньГруппировки = 2;
	ОбластьШапка1 = Макет.ПолучитьОбласть("ОбластьШапкаОсновныеПоля1");
	ОбластьШапка1.Параметры.ЗаголовокТаблицыРасхождений = ЗаголовокТаблицыРасхождений;
	ТабДок.Вывести(ОбластьШапка1, УровеньГруппировки, , ГруппаОткрыта);
	УровеньГруппировки = УровеньГруппировки + 1;
	ГруппаОткрыта = Ложь;
	ОбластьШапка2 = Макет.ПолучитьОбласть("ОбластьШапкаОсновныеПоля2");
	ТабДок.Вывести(ОбластьШапка2, УровеньГруппировки, , ГруппаОткрыта);
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрокаОсновныеПоля");
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из НесовпадающиеПоля Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЗ);
		НомерСтроки = НомерСтроки + 1;
		ОбластьСтрока.Параметры.НПП = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока, УровеньГруппировки, , ГруппаОткрыта);
	КонецЦикла;
КонецПроцедуры

Процедура СверитьДанныеПоНоминалу(ЦеннаяБумага, ТЗНоминалЦБ_BQ, ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет, ЕстьРасхождения)
	ТЗНоминалИзBQ = ДанныеОНоминалеСТипамиКакВ1С(ТЗНоминалЦБ_BQ);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// BSLLS:FullOuterJoinQuery-off
	"ВЫБРАТЬ
	|	ТЗНоминалИзBQ.BVDate КАК BVDate,
	|	ТЗНоминалИзBQ.BaseValue КАК BaseValue
	|ПОМЕСТИТЬ ВТ_НоминалИзBQ
	|ИЗ
	|	&ТЗНоминалИзBQ КАК ТЗНоминалИзBQ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоминалЦБ.Период КАК Период,
	|	НоминалЦБ.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_НоминалИзДЕПО
	|ИЗ
	|	РегистрСведений.НоминалЦБ КАК НоминалЦБ
	|ГДЕ
	|	НоминалЦБ.ЦеннаяБумага = &ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_НоминалИзBQ.BVDate, Неопределено) КАК BVDate,
	|	ЕСТЬNULL(ВТ_НоминалИзBQ.BaseValue, Неопределено) КАК BaseValue,
	|	ЕСТЬNULL(ВТ_НоминалИзДЕПО.Период, Неопределено) КАК Период,
	|	ЕСТЬNULL(ВТ_НоминалИзДЕПО.Сумма, Неопределено) КАК Сумма
	|ИЗ
	|	ВТ_НоминалИзBQ КАК ВТ_НоминалИзBQ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_НоминалИзДЕПО КАК ВТ_НоминалИзДЕПО
	|		ПО ВТ_НоминалИзBQ.BVDate = ВТ_НоминалИзДЕПО.Период";
	// BSLLS:FullOuterJoinQuery-on
	Запрос.УстановитьПараметр("ТЗНоминалИзBQ", ТЗНоминалИзBQ);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗНоминалы = РезультатЗапроса.Выгрузить();
	ЕстьРасхожденияВНоминалах = Ложь;
	Для Каждого СтрокаТЗ Из ТЗНоминалы Цикл
		Если СтрокаТЗ.BaseValue <> СтрокаТЗ.Сумма Тогда
			ЕстьРасхожденияВНоминалах = Истина;
			ЕстьРасхождения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ЕстьРасхожденияВНоминалах Тогда
		ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет);
		ВывестиИнформациюОНесовпадающихНоминалах(ТЗНоминалы, ТабДок, Макет);
	КонецЕсли;
КонецПроцедуры

Функция ДанныеОНоминалеСТипамиКакВ1С(ТЗНоминалЦБ_BQ)
	ТЗНоминалИзBQ = Новый ТаблицаЗначений;
	ОписаниеТипаДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	ОписаниеТипаЧисло3220 = ОбщегоНазначения.ОписаниеТипаЧисло(32, 20);
	
	ТЗНоминалИзBQ.Колонки.Добавить("BVDate", ОписаниеТипаДата);
	ТЗНоминалИзBQ.Колонки.Добавить("BaseValue", ОписаниеТипаЧисло3220);
	
	Для Каждого СтрокаТЗ Из ТЗНоминалЦБ_BQ Цикл
		НовСтрокаТЗ = ТЗНоминалИзBQ.Добавить();
		НовСтрокаТЗ.BVDate = РаботаСДаннымиBQВызовСервера.ЧислоВДату(СтрокаТЗ.BVDate);
		НовСтрокаТЗ.BaseValue = ОписаниеТипаЧисло3220.ПривестиЗначение(СтрокаТЗ.BaseValue);
	КонецЦикла;
		
	Возврат ТЗНоминалИзBQ;
КонецФункции

Процедура ВывестиИнформациюОНесовпадающихНоминалах(ТЗНоминалы, ТабДок, Макет)
	ГруппаОткрыта = Ложь;
	УровеньГруппировки = 2;
	ОбластьШапка1 = Макет.ПолучитьОбласть("ОбластьШапкаНоминалы1");
	ТабДок.Вывести(ОбластьШапка1, УровеньГруппировки, , ГруппаОткрыта);
	УровеньГруппировки = УровеньГруппировки + 1;
	ГруппаОткрыта = Ложь;
	ОбластьШапка2 = Макет.ПолучитьОбласть("ОбластьШапкаНоминалы2");
	ТабДок.Вывести(ОбластьШапка2, УровеньГруппировки, , ГруппаОткрыта);
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрокаНоминалы");
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из ТЗНоминалы Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЗ);
		НомерСтроки = НомерСтроки + 1;
		ОбластьСтрока.Параметры.НПП = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока, УровеньГруппировки, , ГруппаОткрыта);
	КонецЦикла;
КонецПроцедуры

Процедура СверитьДанныеПоКупонам(ЦеннаяБумага, ТЗКупоныЦБ_BQ, ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет, ЕстьРасхождения)
	ТЗКупоныИзBQ = ДанныеОКупонахСТипамиКакВ1С(ТЗКупоныЦБ_BQ);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	// BSLLS:FullOuterJoinQuery-off
	"ВЫБРАТЬ
	|	ТЗКупоныИзBQ.CouponNum КАК CouponNum,
	|	ТЗКупоныИзBQ.BeginDate КАК BeginDate,
	|	ТЗКупоныИзBQ.EndDate КАК EndDate,
	|	ТЗКупоныИзBQ.Procent КАК Procent,
	|	ТЗКупоныИзBQ.Volume КАК Volume,
	|	ТЗКупоныИзBQ.CloseDate КАК CloseDate
	|ПОМЕСТИТЬ ВТ_КупоныИзBQ
	|ИЗ
	|	&ТЗКупоныИзBQ КАК ТЗКупоныИзBQ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦенныеБумагиКупоны.НомерКупона КАК НомерКупона,
	|	ЦенныеБумагиКупоны.ДатаВыпуска КАК ДатаВыпуска,
	|	ЦенныеБумагиКупоны.ДатаПогашения КАК ДатаПогашения,
	|	ЦенныеБумагиКупоны.Ставка КАК Ставка,
	|	ЦенныеБумагиКупоны.Сумма КАК Сумма,
	|	ЦенныеБумагиКупоны.ДатаФиксацииСписка КАК ДатаФиксацииСписка
	|ПОМЕСТИТЬ ВТ_КупоныИзДЕПО
	|ИЗ
	|	Справочник.ЦенныеБумаги.Купоны КАК ЦенныеБумагиКупоны
	|ГДЕ
	|	ЦенныеБумагиКупоны.Ссылка = &ЦеннаяБумага
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_КупоныИзBQ.CouponNum, НЕОПРЕДЕЛЕНО) КАК CouponNum,
	|	ЕСТЬNULL(ВТ_КупоныИзBQ.BeginDate, НЕОПРЕДЕЛЕНО) КАК BeginDate,
	|	ЕСТЬNULL(ВТ_КупоныИзBQ.EndDate, НЕОПРЕДЕЛЕНО) КАК EndDate,
	|	ЕСТЬNULL(ВТ_КупоныИзBQ.Procent, НЕОПРЕДЕЛЕНО) КАК Procent,
	|	ЕСТЬNULL(ВТ_КупоныИзBQ.Volume, НЕОПРЕДЕЛЕНО) КАК Volume,
	|	ЕСТЬNULL(ВТ_КупоныИзBQ.CloseDate, НЕОПРЕДЕЛЕНО) КАК CloseDate,
	|	ЕСТЬNULL(ВТ_КупоныИзДЕПО.НомерКупона, НЕОПРЕДЕЛЕНО) КАК НомерКупона,
	|	ЕСТЬNULL(ВТ_КупоныИзДЕПО.ДатаВыпуска, НЕОПРЕДЕЛЕНО) КАК ДатаВыпуска,
	|	ЕСТЬNULL(ВТ_КупоныИзДЕПО.ДатаПогашения, НЕОПРЕДЕЛЕНО) КАК ДатаПогашения,
	|	ЕСТЬNULL(ВТ_КупоныИзДЕПО.Ставка, НЕОПРЕДЕЛЕНО) КАК Ставка,
	|	ЕСТЬNULL(ВТ_КупоныИзДЕПО.Сумма, НЕОПРЕДЕЛЕНО) КАК Сумма,
	|	ЕСТЬNULL(ВТ_КупоныИзДЕПО.ДатаФиксацииСписка, НЕОПРЕДЕЛЕНО) КАК ДатаФиксацииСписка
	|ИЗ
	|	ВТ_КупоныИзBQ КАК ВТ_КупоныИзBQ
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_КупоныИзДЕПО КАК ВТ_КупоныИзДЕПО
	|		ПО ВТ_КупоныИзBQ.CouponNum = ВТ_КупоныИзДЕПО.НомерКупона
	|";
	// BSLLS:FullOuterJoinQuery-on
	Запрос.УстановитьПараметр("ТЗКупоныИзBQ", ТЗКупоныИзBQ);
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	РезультатЗапроса = Запрос.Выполнить();
	ТЗКупоны = РезультатЗапроса.Выгрузить();
	ЕстьРасхожденияВКупонах = Ложь;
	Для Каждого СтрокаТЗ Из ТЗКупоны Цикл
		Если ЕстьРасхожденияВКупонахСОдинаковымНомером(СтрокаТЗ) Тогда
			ЕстьРасхожденияВКупонах = Истина;
			ЕстьРасхождения = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
		
	Если ЕстьРасхожденияВКупонах Тогда
		ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет);
		ВывестиИнформациюОНесовпадающихКупонах(ТЗКупоны, ТабДок, Макет);
	КонецЕсли;
КонецПроцедуры

Функция ЕстьРасхожденияВКупонахСОдинаковымНомером(ДанныеОКупонах)
	ЕстьРасхождения = ДанныеОКупонах.BeginDate <> ДанныеОКупонах.ДатаВыпуска
						Или ДанныеОКупонах.EndDate <> ДанныеОКупонах.ДатаПогашения
						Или ДанныеОКупонах.Procent <> ДанныеОКупонах.Ставка
						Или ДанныеОКупонах.Volume <> ДанныеОКупонах.Сумма
						Или ДанныеОКупонах.CloseDate <> ДанныеОКупонах.ДатаФиксацииСписка;
	Возврат ЕстьРасхождения;
КонецФункции

Функция ДанныеОКупонахСТипамиКакВ1С(ТЗКупоныЦБ_BQ)
	ТЗКупоныИзBQ = Новый ТаблицаЗначений;
	ОписаниеТипаДата = ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата);
	ОписаниеТипаЧисло10 = ОбщегоНазначения.ОписаниеТипаЧисло(10, 0);
	ОписаниеТипаЧисло105 = ОбщегоНазначения.ОписаниеТипаЧисло(10, 5);
	ОписаниеТипаЧисло228 = ОбщегоНазначения.ОписаниеТипаЧисло(22, 8);
	
	ТЗКупоныИзBQ.Колонки.Добавить("CouponNum", ОписаниеТипаЧисло10);
	ТЗКупоныИзBQ.Колонки.Добавить("BeginDate", ОписаниеТипаДата);
	ТЗКупоныИзBQ.Колонки.Добавить("EndDate", ОписаниеТипаДата);
	ТЗКупоныИзBQ.Колонки.Добавить("Procent", ОписаниеТипаЧисло105);
	ТЗКупоныИзBQ.Колонки.Добавить("Volume", ОписаниеТипаЧисло228);
	ТЗКупоныИзBQ.Колонки.Добавить("CloseDate", ОписаниеТипаДата);
	
	Для Каждого СтрокаТЗ Из ТЗКупоныЦБ_BQ Цикл
		НовСтрокаТЗ = ТЗКупоныИзBQ.Добавить();
		НовСтрокаТЗ.CouponNum = ОписаниеТипаЧисло10.ПривестиЗначение(СтрокаТЗ.CouponNum);
		НовСтрокаТЗ.BeginDate = РаботаСДаннымиBQВызовСервера.ЧислоВДату(СтрокаТЗ.BeginDate);
		НовСтрокаТЗ.EndDate = РаботаСДаннымиBQВызовСервера.ЧислоВДату(СтрокаТЗ.EndDate);
		НовСтрокаТЗ.Procent = ОписаниеТипаЧисло105.ПривестиЗначение(СтрокаТЗ.Procent);
		НовСтрокаТЗ.Volume = ОписаниеТипаЧисло228.ПривестиЗначение(СтрокаТЗ.Volume);
		НовСтрокаТЗ.CloseDate = РаботаСДаннымиBQВызовСервера.ЧислоВДату(СтрокаТЗ.CloseDate);
	КонецЦикла;
		
	Возврат ТЗКупоныИзBQ;
КонецФункции

Процедура ВывестиИнформациюОНесовпадающихКупонах(ТЗКупоны, ТабДок, Макет)
	ГруппаОткрыта = Ложь;
	УровеньГруппировки = 2;
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапкаКупоны1");
	ТабДок.Вывести(ОбластьШапка, УровеньГруппировки, , ГруппаОткрыта);
	УровеньГруппировки = УровеньГруппировки + 1;
	ГруппаОткрыта = Ложь;
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапкаКупоны2");
	ТабДок.Вывести(ОбластьШапка, УровеньГруппировки, , ГруппаОткрыта);
	ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрокаКупоны");
	НомерСтроки = 0;
	Для каждого СтрокаТЗ Из ТЗКупоны Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаТЗ);
		НомерСтроки = НомерСтроки + 1;
		ОбластьСтрока.Параметры.НПП = НомерСтроки;
		ТабДок.Вывести(ОбластьСтрока, УровеньГруппировки, , ГруппаОткрыта);
	КонецЦикла;
КонецПроцедуры

Процедура СверитьДанныеПоНКД(ЦеннаяБумага, ТЗ_НКД_ЦБ_BQ, ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет, ЕстьРасхождения)
	Если ЗначениеЗаполнено(ТЗ_НКД_ЦБ_BQ) Тогда
		ТекНКД_BQ = ТЗ_НКД_ЦБ_BQ[0];
		AccruedDate = РаботаСДаннымиBQВызовСервера.ЧислоВДату(ТекНКД_BQ.AccruedDate);
		Volume = ТекНКД_BQ.Volume;
	Иначе
		AccruedDate = Неопределено;
		Volume = Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НКД.Период КАК Период,
	|	ВЫБОР
	|		КОГДА НКД.Биржа = ЗНАЧЕНИЕ(Справочник.ИнформационноАналитическиеСистемы.CBonds)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приоритет,
	|	НКД.AccInt КАК AccInt
	|ПОМЕСТИТЬ ВТ_НКД
	|ИЗ
	|	РегистрСведений.НКД КАК НКД
	|ГДЕ
	|	НКД.ЦеннаяБумага = &ЦеннаяБумага
	|	И НКД.Период = &ТекущаяДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_НКД.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МаксПриоритет
	|ИЗ
	|	ВТ_НКД КАК ВТ_НКД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НКД.Период КАК Период,
	|	ВТ_НКД.AccInt КАК AccInt
	|ИЗ
	|	ВТ_МаксПриоритет КАК ВТ_МаксПриоритет
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НКД КАК ВТ_НКД
	|		ПО ВТ_МаксПриоритет.Приоритет = ВТ_НКД.Приоритет";
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Период = Выборка.Период;
		AccInt = Выборка.AccInt;
	Иначе
		Период = Неопределено;
		AccInt = Неопределено;
	КонецЕсли;
	
	Если Не ЧислоИзДепоСовпадаетСоСтрокойИзBQ(AccInt, Volume) Тогда
		ЕстьРасхождения = Истина;
		ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет);
		ГруппаОткрыта = Ложь;
		УровеньГруппировки = 2;
		ОбластьШапка1 = Макет.ПолучитьОбласть("ОбластьШапкаНКД1");
		ТабДок.Вывести(ОбластьШапка1, УровеньГруппировки, , ГруппаОткрыта);
		УровеньГруппировки = УровеньГруппировки + 1;
		ГруппаОткрыта = Ложь;
		ОбластьШапка2 = Макет.ПолучитьОбласть("ОбластьШапкаНКД2");
		ТабДок.Вывести(ОбластьШапка2, УровеньГруппировки, , ГруппаОткрыта);
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрокаНКД");
		ОбластьСтрока.Параметры.AccInt = AccInt;
		ОбластьСтрока.Параметры.Период = Период;
		ОбластьСтрока.Параметры.AccruedDate = AccruedDate;
		ОбластьСтрока.Параметры.Volume = Volume;
		ТабДок.Вывести(ОбластьСтрока, УровеньГруппировки, , ГруппаОткрыта);
	КонецЕсли;
	
КонецПроцедуры

Процедура СверитьДанныеПоЭмитенту(ЦеннаяБумага, ДанныеЭмитентаBQ, ЗаголовокПоЦБВыведен, ДанныеЦБИзДЕПО, ТабДок, Макет, ЕстьРасхождения)
	ДанныеЭмитентаДЕПО = ДанныеЭмитентаДЕПО(ЦеннаяБумага);
	
	СверитьОсновныеПоляЭмитента(ДанныеЭмитентаBQ, ДанныеЭмитентаДЕПО, ДанныеЦБИзДЕПО,
								ЗаголовокПоЦБВыведен, ТабДок, Макет, ЕстьРасхождения);
КонецПроцедуры

Функция ДанныеЭмитентаBQ(АДО, СтрокаТЧ, МожноВозвращатьНеопределено = Ложь)
	ДанныеЭмитентаЦБ_BQ = ДанныеИзBQ(АДО, СтрокаТЧ, "GetAssetEmitentFirm", "эмитенте ЦБ");
	Если ЗначениеЗаполнено(ДанныеЭмитентаЦБ_BQ) Тогда
		ДанныеЭмитентаBQ = ДанныеЭмитентаЦБ_BQ[0];
	ИначеЕсли МожноВозвращатьНеопределено Тогда
		ДанныеЭмитентаBQ = Неопределено;
	Иначе
		ДанныеЭмитентаBQ = ПустыеДанныеЭмитентаBQ();
	КонецЕсли;
	
	Возврат ДанныеЭмитентаBQ;
КонецФункции

Функция ПустыеДанныеЭмитентаBQ()
	СписокПолей = "LEI,FirmShortName,Name,EngName,INN,TIN,OKPO,KPP,RegistrNum,OKOGU,OKFS,OKOPF,RegistrDate,RegistrOfficial,"
					+ "RegistrDate2002,RegistrFormNum, IsTaxResident,Country,IsInternationalOrganization,IsInternationalCompany,"
					+ "CategoryChangeDate,IsCreditOrganisation,CodeSector,AdditionalAddr,Phones,Email,URL,EmitentRuDataCode,EmitentNrdCode";
	Возврат Новый Структура(СписокПолей);
КонецФункции

Функция ЭмитентЦБ(ЦеннаяБумага)
	Эмитент = Новый Структура("ЮридическоеЛицо, КодСектораЭкономики", Неопределено, "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЮридическиеЛица.Ссылка КАК ЭмитентЮрЛицо,
	|	ЕСТЬNULL(Контрагенты.СекторЭкономикиИностранногоЭмитента.Код, """") КАК КодСектораЭкономики
	|ИЗ
	|	Справочник.ЦенныеБумаги КАК ЦенныеБумаги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ЦенныеБумаги.Эмитент = Контрагенты.Ссылка
	|			И (ЦенныеБумаги.Ссылка = &ЦеннаяБумага)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)";
	Запрос.УстановитьПараметр("ЦеннаяБумага", ЦеннаяБумага);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Эмитент.ЮридическоеЛицо = Выборка.ЭмитентЮрЛицо;
		Эмитент.КодСектораЭкономики = Выборка.КодСектораЭкономики;
	КонецЕсли;
	
	Возврат Эмитент;
КонецФункции

Функция ДанныеЭмитентаДЕПО(ЦеннаяБумага)
	Эмитент = ЭмитентЦБ(ЦеннаяБумага);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЮрлицаМКСрезПоследних.МеждународнаяКомпания КАК ЭтоМК,
	|	ЮрлицаМКСрезПоследних.Период КАК ДатаСменыСтатусаМК
	|ПОМЕСТИТЬ ВТ_МеждународныеКомпании
	|ИЗ
	|	РегистрСведений.ЮридическиеЛицаМеждународныеКомпании.СрезПоследних(&ТекущаяДата, ЮридическоеЛицо = &ЭмитентЮрЛицо) КАК ЮрлицаМКСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КИСрезПоследних.Представление КАК Адрес
	|ПОМЕСТИТЬ ВТ_ЮридическиеАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Объект = &ЭмитентЮрЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресЮрЛица)) КАК КИСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КИСрезПоследних.Представление КАК Адрес
	|ПОМЕСТИТЬ ВТ_ФактическиеАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Объект = &ЭмитентЮрЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ФактАдресЮрЛица)) КАК КИСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КИСрезПоследних.Представление КАК Адрес
	|ПОМЕСТИТЬ ВТ_ПочтовыеАдреса
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Объект = &ЭмитентЮрЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЮрлицаПочтовый)) КАК КИСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КИСрезПоследних.Представление КАК Телефоны
	|ПОМЕСТИТЬ ВТ_Телефоны
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Объект = &ЭмитентЮрЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонЮрЛица)) КАК КИСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КИСрезПоследних.Представление КАК Email
	|ПОМЕСТИТЬ ВТ_АдресаЭлектроннойПочты
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Объект = &ЭмитентЮрЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
	|				И Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailЮрЛица)) КАК КИСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КИСрезПоследних.Представление КАК ВебСтраница
	|ПОМЕСТИТЬ ВТ_ВебСтраницы
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ТекущаяДата,
	|			Объект = &ЭмитентЮрЛицо
	|				И Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.ВебСтраница)) КАК КИСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	&ЭмитентЮрЛицо КАК Ссылка,
	|	ЕСТЬNULL(КодыRuData.Код, """") КАК КодRuData,
	|	ЕСТЬNULL(КодыНРД.Код, """") КАК КодНРД,
	|	ЕСТЬNULL(КодыLEI.Код, """") КАК КодLEI,
	|	ЮридическиеЛица.Наименование КАК Наименование,
	|	ЮридическиеЛица.ПолноеНаименование КАК ПолноеНаименование,
	|	ЮридическиеЛица.ПолноеНаименованиеНаАнглийскомЯзыке КАК ПолноеНаименованиеНаАнглийскомЯзыке,
	|	ЮридическиеЛица.ИНН КАК ИНН,
	|	ЮридическиеЛица.TIN КАК TIN,
	|	ЮридическиеЛица.КодПоОКПО КАК КодПоОКПО,
	|	ЮридическиеЛица.КПП КАК КПП,
	|	ЮридическиеЛица.ОГРН КАК ОГРН,
	|	ЮридическиеЛица.ОКОГУ КАК ОКОГУ,
	|	ЮридическиеЛица.ОКФС КАК ОКФС,
	|	ЮридическиеЛица.ОКОПФ КАК ОКОПФ,
	|	ЮридическиеЛица.ДатаГосРегистрации КАК ДатаГосРегистрации,
	|	ЮридическиеЛица.РегистрирующийОрган КАК РегистрирующийОрган,
	|	ЮридическиеЛица.РегНомер КАК РегНомер,
	|	ЮридическиеЛица.ДатаВнесенияВЕГРЮЛ КАК ДатаВнесенияВЕГРЮЛ,
	|	ЮридическиеЛица.НеРезидент КАК НеРезидент,
	|	ЕСТЬNULL(ЮридическиеЛица.Страна.КодАльфа2, """") КАК КодСтраны,
	|	ЮридическиеЛица.МеждународнаяОрганизация КАК МеждународнаяОрганизация,
	|	ЕСТЬNULL(ВТ_МеждународныеКомпании.ЭтоМК, ЛОЖЬ) КАК МеждународнаяКомпания,
	|	ЕСТЬNULL(ВТ_МеждународныеКомпании.ДатаСменыСтатусаМК, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаСменыСтатусаМК,
	|	ЮридическиеЛица.КредитнаяОрганизация КАК КредитнаяОрганизация,
	|	&КодСектораЭкономики КАК КодСектораЭкономикиИностранногоЭмитента,
	|	ЕСТЬNULL(ВТ_ЮридическиеАдреса.Адрес, ЕСТЬNULL(ВТ_ФактическиеАдреса.Адрес, ЕСТЬNULL(ВТ_ПочтовыеАдреса.Адрес, """"))) КАК Адрес,
	|	ЕСТЬNULL(ВТ_Телефоны.Телефоны, """") КАК Телефоны,
	|	ЕСТЬNULL(ВТ_АдресаЭлектроннойПочты.Email, """") КАК Email,
	|	ЕСТЬNULL(ВТ_ВебСтраницы.ВебСтраница, """") КАК ВебСтраница
	|ИЗ
	|	Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыRuData
	|		ПО ЮридическиеЛица.Ссылка = КодыRuData.Владелец
	|			И (КодыRuData.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.RuData))
	|			И (НЕ КодыRuData.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыRuData.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыRuData.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыНРД
	|		ПО ЮридическиеЛица.Ссылка = КодыНРД.Владелец
	|			И (КодыНРД.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.NrdCode))
	|			И (НЕ КодыНРД.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыНРД.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыНРД.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КодыЗагрузки КАК КодыLEI
	|		ПО ЮридическиеЛица.Ссылка = КодыLEI.Владелец
	|			И (КодыLEI.Биржа = ЗНАЧЕНИЕ(Справочник.КлассификаторыЗагрузки.LEI_Code))
	|			И (НЕ КодыLEI.ПометкаУдаления)
	|			И (ВЫБОР
	|				КОГДА КодыLEI.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|					ТОГДА ИСТИНА
	|				КОГДА КодыLEI.ДатаОкончанияДействия > &ТекущаяДата
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ЛОЖЬ
	|			КОНЕЦ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпании КАК ВТ_МеждународныеКомпании
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЮридическиеАдреса КАК ВТ_ЮридическиеАдреса
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ФактическиеАдреса КАК ВТ_ФактическиеАдреса
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПочтовыеАдреса КАК ВТ_ПочтовыеАдреса
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Телефоны КАК ВТ_Телефоны
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АдресаЭлектроннойПочты КАК ВТ_АдресаЭлектроннойПочты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВебСтраницы КАК ВТ_ВебСтраницы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ЮридическиеЛица.Ссылка = &ЭмитентЮрЛицо";
	Запрос.УстановитьПараметр("ЭмитентЮрЛицо", Эмитент.ЮридическоеЛицо);
	Запрос.УстановитьПараметр("КодСектораЭкономики", Эмитент.КодСектораЭкономики);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	ТЗДанныеЭмитента = РезультатЗапроса.Выгрузить();
	Если ТЗДанныеЭмитента.Количество() = 0 Тогда
		ТЗДанныеЭмитента.Добавить();
	КонецЕсли;
	
	Возврат ТЗДанныеЭмитента[0];
КонецФункции

Процедура СверитьОсновныеПоляЭмитента(ДанныеЭмитентаBQ, ДанныеЭмитентаДЕПО, ОсновныеДанныеЦБ_ДЕПО,
										ЗаголовокПоЦБВыведен, ТабДок, Макет, ЕстьРасхождения)
	НесовпадающиеПоля = НовыйТаблицаПолейСНесовпадающимиЗначениями();
	
	СоответствиеИменРеквизитов = СоответствиеИменОсновныхРеквизитовЭмитента();
	Для Каждого Элемент Из СоответствиеИменРеквизитов Цикл
		СравнитьОдинРеквизитЭмитента(ДанныеЭмитентаBQ, ДанныеЭмитентаДЕПО, Элемент.Значение, Элемент.Ключ, НесовпадающиеПоля);
	КонецЦикла;
	
	ЕстьРасхожденияВЭмитенте = (НесовпадающиеПоля.Количество() <> 0);
	Если ЕстьРасхожденияВЭмитенте Тогда
		ВывестиЗаголовокПоЦБ(ЗаголовокПоЦБВыведен, ОсновныеДанныеЦБ_ДЕПО, ТабДок, Макет);
		ТипРасхождений = "Расхождения в основной информации об эмитенте:";
		ВывестиИнформациюОНесовпадающихРеквизитах(ТипРасхождений, НесовпадающиеПоля, ТабДок, Макет, "ОсновныеПоляЭмитента");
		ЕстьРасхождения = ЕстьРасхожденияВЭмитенте;
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьОдинРеквизитЭмитента(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля)
	Если ДанныеИзBQ = Неопределено Тогда
		ЗначениеРеквизитаДЕПО = ДанныеИзДЕПО[ИмяРеквизитаДЕПО];
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, "Н/Д", ЗначениеРеквизитаДЕПО);
	Иначе
		Если ИмяРеквизитаДЕПО = "НеРезидент" Тогда
			СравнитьРезидентство(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
		Иначе
			СравнитьРеквизиты(ДанныеИзBQ, ДанныеИзДЕПО, ИмяРеквизитаBQ, ИмяРеквизитаДЕПО, НесовпадающиеПоля);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура СравнитьРезидентство(ДанныеИзBQ, ДанныеИзДЕПО,  ИмяПоляBQ, ИмяПоляДЕПО, НесовпадающиеПоля)
	ЗначениеПоляBQ = ДанныеИзBQ[ИмяПоляBQ];
	ЗначениеПоляДЕПО = ДанныеИзДЕПО[ИмяПоляДЕПО];
	
	ЗначениеДляСравненияДЕПО = ЗначениеПоляДЕПО;
	Если ЗначениеПоляBQ = "y" Тогда
		ЗначениеДляСравненияBQ = Ложь;
	ИначеЕсли ЗначениеПоляBQ = "n" Тогда
		ЗначениеДляСравненияBQ = Истина;
	Иначе
		ЗначениеДляСравненияBQ = ЗначениеПоляBQ;
	КонецЕсли;
	
	Если ЗначениеДляСравненияBQ <> ЗначениеДляСравненияДЕПО Тогда
		ДобавитьВНесовпадающиеПоля(НесовпадающиеПоля, ИмяПоляBQ, ИмяПоляДЕПО, ЗначениеПоляBQ, ЗначениеПоляДЕПО);
	КонецЕсли;
КонецПроцедуры

Функция ЧислоИзДепоСовпадаетСоСтрокойИзBQ(ЗначениеИзДЕПО, ЗначениеИзBQ)
	ЗначениеДляСравненияДЕПО = ЧислоВСтроку(ЗначениеИзДЕПО);
	ЗначениеДляСравненияBQ = СтрокаВЧисло(ЗначениеИзBQ);
	
	Возврат (ЗначениеДляСравненияДЕПО = ЗначениеДляСравненияBQ);
КонецФункции

Функция СтрокаВЧисло(ЗначениеСтрока)
	Возврат СтрЗаменить(СтрЗаменить(СокрЛП(ЗначениеСтрока), Символы.НПП, ""), " ", "");
КонецФункции

Функция ЧислоВСтроку(ЗначениеЧисло)
	Возврат СтрЗаменить(СтрЗаменить(Строка(ЗначениеЧисло), Символы.НПП, ""), " ", "");
КонецФункции

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
